/*
* Hello libraries test
* * Author: Yakimenko Semen
* E-mail: jssem@yandex.ru
* Site: <http://www.robo-labs.ru>
* 
*/


// Подключаем, созданную Вами, библиотеку
#include "Libtest.h"

//Создаем объект класса этой библиотеке по принципу 
//[имя класса][пробел][имя объекта - любое имя]
//   [класс] [объект]
     Libtest libtest;

void setup()
{
Serial.begin(9600);
}
void loop()
{
/*	Для получения доступа к тем функциям, 
*	которые Вы создали и описали в Вашей библиотеке, 
*	необходимо использовать созданный выше объект класса по принципу
*	[объект] [точка] [имя функции]
*/

// [объект][имя функции]  
   libtest.hello_world(); // выводим в терминал слово "Hello"
// Все!!!
}








